In [1]:
# concatenation
a = [1,2,3]
b = [4,5,9]
c = a+b
print(c)

[1, 2, 3, 4, 5, 9]

In [2]:
a = '3'
b = '2'
c = a+b
c

'32'

In [3]:
import pandas as pd

In [4]:
s1 = pd.Series([1,2,3])
s2 = pd.Series([4,5,9])
pd.concat([s1,s2])

0    1
1    2
2    3
0    4
1    5
2    9
dtype: int64

In [5]:
df = pd.read_excel(r'C:\Users\Satyam\Downloads\groupby.xlsx')

In [6]:
df

  Name  Age  Marks
0    A   21     45
1    B   21     89
2    C   32     89
3    D   24     45
4    E   24     89
5    F   21     90

In [8]:
df.groupby('Age').get_group(21)

  Name  Age  Marks
0    A   21     45
1    B   21     89
5    F   21     90

In [9]:
df.groupby('Age').get_group(24)

  Name  Age  Marks
3    D   24     45
4    E   24     89

In [11]:
df.groupby('Marks').get_group(45)

  Name  Age  Marks
0    A   21     45
3    D   24     45

In [12]:
df.groupby('Marks').get_group(89)

  Name  Age  Marks
1    B   21     89
2    C   32     89
4    E   24     89

In [ ]:
20 info.